#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/statuc_devops/armageddon-github-actions/runs/run-gHqnF4b2XYW2ZL8T

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
data.aws_ami.latest-amazon-linux-image: Refreshing...
data.aws_ami.latest-amazon-linux-image: Refresh complete after 0s [id=ami-0df8c184d5f6ae949]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.ASG01_NY_attachment will be created
  + resource "aws_autoscaling_attachment" "ASG01_NY_attachment" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.ASG01_NY will be created
  + resource "aws_autoscaling_group" "ASG01_NY" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 5
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "ASG01-NewYork-auto-scaling-group"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_TERMINATING"
          + name                    = "scale-in-protection"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "CONTINUE"
          + heartbeat_timeout       = 60
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "instance-protection-launch"
          + notification_metadata   = jsonencode(
                {
                  + key = "value"
                }
            )
            # (2 unchanged attributes hidden)
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Production"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app1-NY-instance"
        }
    }

  # aws_autoscaling_policy.app1_NY_scaling_policy will be created
  + resource "aws_autoscaling_policy" "app1_NY_scaling_policy" {
      + arn                       = (known after apply)
      + autoscaling_group_name    = (known after apply)
      + estimated_instance_warmup = 120
      + id                        = (known after apply)
      + metric_aggregation_type   = (known after apply)
      + name                      = "app1-cpu-target"
      + policy_type               = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # aws_eip.eip_NY will be created
  + resource "aws_eip" "eip_NY" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "eip_NY"
        }
      + tags_all             = {
          + "Name" = "eip_NY"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw_NY will be created
  + resource "aws_internet_gateway" "igw_NY" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "application_NY_IGW"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all = {
          + "Name"    = "application_NY_IGW"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.app1_NewYork_LT will be created
  + resource "aws_launch_template" "app1_NewYork_LT" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0453ec754f44f9a4a"
      + instance_type          = "t2.micro"
      + key_name               = "linux_appserver_key"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "app1_NY_LT"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKIyBVc2UgdGhpcyBmb3IgeW91ciB1c2VyIGRhdGEgKHNjcmlwdCBmcm9tIHRvcCB0byBib3R0b20pCiMgaW5zdGFsbCBodHRwZCAoTGludXggMiB2ZXJzaW9uKQpzdWRvIHl1bSB1cGRhdGUgLXkKc3VkbyB5dW0gaW5zdGFsbCAteSBodHRwZApzdWRvIHN5c3RlbWN0bCBlbmFibGUgaHR0cGQKc3VkbyBzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKCiMgR2V0IHRoZSBJTURTdjIgdG9rZW4KVE9LRU49JChjdXJsIC1YIFBVVCAiaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvYXBpL3Rva2VuIiAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuLXR0bC1zZWNvbmRzOiAyMTYwMCIpCgojIEJhY2tncm91bmQgdGhlIGN1cmwgcmVxdWVzdHMKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9sb2NhbC1pcHY0ICY+IC90bXAvbG9jYWxfaXB2NCAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvcGxhY2VtZW50L2F2YWlsYWJpbGl0eS16b25lICY+IC90bXAvYXogJgpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL25ldHdvcmsvaW50ZXJmYWNlcy9tYWNzLyAmPiAvdG1wL21hY2lkICYKd2FpdAoKbWFjaWQ9JChjYXQgL3RtcC9tYWNpZCkKbG9jYWxfaXB2ND0kKGNhdCAvdG1wL2xvY2FsX2lwdjQpCmF6PSQoY2F0IC90bXAvYXopCnZwYz0kKGN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvJHttYWNpZH0vdnBjLWlkKQoKZWNobyAiCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPVwiZW5cIiBjbGFzcz1cImgtMTAwXCI+CjxoZWFkPgo8dGl0bGU+RGV0YWlscyBmb3IgRUMyIGluc3RhbmNlPC90aXRsZT4KPC9oZWFkPgo8Ym9keT4KPGRpdj4KPGgxPkFXUyBJbnN0YW5jZSBEZXRhaWxzPC9oMT4KPGgxPlNhbXVyYWkgS2F0YW5hPC9oMT4KCjxicj4KIyBpbnNlcnQgYW4gaW1hZ2Ugb3IgR0lGCjxpbWcgc3JjPSJodHRwczovL3d3dy53M3NjaG9vbHMuY29tL2ltYWdlcy93M3NjaG9vbHNfZ3JlZW4uanBnIiBhbHQ9IlczU2Nob29scy5jb20iPgo8YnI+Cgo8cD48Yj5JbnN0YW5jZSBOYW1lOjwvYj4gJChob3N0bmFtZSAtZikgPC9wPgo8cD48Yj5JbnN0YW5jZSBQcml2YXRlIElwIEFkZHJlc3M6IDwvYj4gJHtsb2NhbF9pcHY0fTwvcD4KPHA+PGI+QXZhaWxhYmlsaXR5IFpvbmU6IDwvYj4gJHthen08L3A+CjxwPjxiPlZpcnR1YWwgUHJpdmF0ZSBDbG91ZCAoVlBDKTo8L2I+ICR7dnBjfTwvcD4KPC9kaXY+CjwvYm9keT4KPC9odG1sPgoiID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCgojIENsZWFuIHVwIHRoZSB0ZW1wIGZpbGVzCnJtIC1mIC90bXAvbG9jYWxfaXB2NCAvdG1wL2F6IC90bXAvbWFjaWQ="
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "app1_NY_LT"
              + "Owner"   = "Frodo"
              + "Planet"  = "Arda"
              + "Service" = "application1"
            }
        }
    }

  # aws_lb.ASG01-NY-LB01 will be created
  + resource "aws_lb" "ASG01-NY-LB01" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "ASG01-NewYork-load-balancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Name"    = "ASG01-NY-LB01"
          + "Owner"   = "Frodo"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + tags_all                   = {
          + "Name"    = "ASG01-NY-LB01"
          + "Owner"   = "Frodo"
          + "Project" = "Web Service"
          + "Service" = "App1"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.http_NY will be created
  + resource "aws_lb_listener" "http_NY" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.ASG01_NY_TG01 will be created
  + resource "aws_lb_target_group" "ASG01_NY_TG01" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "ASG01-NewYork-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "ASG01-NY-TG01"
          + "Owner"   = "Frodo"
          + "Project" = "Web Service"
          + "Service" = "ASG01-NY"
        }
      + tags_all                           = {
          + "Name"    = "ASG01-NY-TG01"
          + "Owner"   = "Frodo"
          + "Project" = "Web Service"
          + "Service" = "ASG01-NY"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)
    }

  # aws_nat_gateway.nat_NY will be created
  + resource "aws_nat_gateway" "nat_NY" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat_NY"
        }
      + tags_all             = {
          + "Name" = "nat_NY"
        }
    }

  # aws_route_table.private_NY will be created
  + resource "aws_route_table" "private_NY" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private_NY"
        }
      + tags_all         = {
          + "Name" = "private_NY"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_NY will be created
  + resource "aws_route_table" "public_NY" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "public_NY"
        }
      + tags_all         = {
          + "Name" = "public_NY"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-us-east-1a will be created
  + resource "aws_route_table_association" "private-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1b will be created
  + resource "aws_route_table_association" "private-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1a will be created
  + resource "aws_route_table_association" "public-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1b will be created
  + resource "aws_route_table_association" "public-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ASG01-SG01-NY-LB01 will be created
  + resource "aws_security_group" "ASG01-SG01-NY-LB01" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP inbound traffic to Load Balancer."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ASG01-SG01-NY-LB01"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "ASG01-SG01-NY-LB01"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "ASG01-SG01-NY-LB01"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ASG01-SG02-NY-TG80 will be created
  + resource "aws_security_group" "ASG01-SG02-NY-TG80" {
      + arn                    = (known after apply)
      + description            = "allow traffic to ASG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ASG01-SG02-NY-TG80"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "ASG01-SG02-NY-TG80"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "ASG01-SG02-NY-TG80"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ASG01-SG03-NY-servers will be created
  + resource "aws_security_group" "ASG01-SG03-NY-servers" {
      + arn                    = (known after apply)
      + description            = "Allow SSH and HTTP traffic to production servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "ASG01-SG03-NY-servers"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "ASG01-SG03-NY-servers"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "ASG01-SG03-NY-servers"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private-us-east-1a will be created
  + resource "aws_subnet" "private-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1b will be created
  + resource "aws_subnet" "private-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1a will be created
  + resource "aws_subnet" "public-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1b will be created
  + resource "aws_subnet" "public-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.21.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.VPC-B-NewYork-Test will be created
  + resource "aws_vpc" "VPC-B-NewYork-Test" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.21.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "VPC-B-NewYork-Test"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
      + tags_all                             = {
          + "Name"    = "VPC-B-NewYork-Test"
          + "Owner"   = "Frodo"
          + "Planet"  = "Arda"
          + "Service" = "application1"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws-ami_id = "ami-0df8c184d5f6ae949"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @statuc30721, Action: `pull_request`*